Долома/src/Documents/ПеремещениеЖивотных/ПеремещениеЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеЖивотных</name>
  <basedOn>Document.РождениеТеленка</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.ЗапускЖивотных</registerRecords>
  <registerRecords>InformationRegister.КонтрольныеНадои</registerRecords>
  <registerRecords>InformationRegister.РазмещениеЖивотных</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Запуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорпусОтправитель</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>КорпусПолучатель</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>ФермаОтправитель</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФермаПолучатель</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждуКорпусамиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждуФермамиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЖивотныеЗапуск</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Удой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПрепаратов</name>
    <attributes>
      <name>Препарат</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЖивотныеМеждуКорпусами</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЖивотныеМеждуФермами</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/InformationRegisters/Осеменения/Осеменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Осеменения</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Осеменатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Инъекция</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДоз</name>
    <comment>Использованное количество доз семени</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СхемаСинхронизации</name>
    <type>
      <types>CatalogRef.СхемыСинхронизации</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семя</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйКлючЗаписи</name>
    <comment>Нужен для более чем одной строки не уникальной записи (документ ДобавлениеЖивотного)</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/СостояниеЖивотных/СостояниеЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеЖивотных</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СостояниеЖивотного</name>
    <type>
      <types>EnumRef.СтатусЖивотного</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/ДатаПредполагаемогоОтёла/ДатаПредполагаемогоОтёла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаПредполагаемогоОтёла</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаПредполагаемогоОтёла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/ИнформацияОРождении/ИнформацияОРождении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияОРождении</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолЖивотного</types>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФермаРождения</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Documents/ПеремещениеЖивотных/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ПеремещениеЖивотных.ПолучитьМакет("ОписьЖивотных");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеЖивотныхЖивотныеМеждуКорпусами.Животное КАК Животное,
	|	ПеремещениеЖивотныхЖивотныеМеждуКорпусами.Ссылка КАК Документ
	|ПОМЕСТИТЬ вт_Животные
	|ИЗ
	|	Документ.ПеремещениеЖивотных.ЖивотныеМеждуКорпусами КАК ПеремещениеЖивотныхЖивотныеМеждуКорпусами
	|ГДЕ
	|	ПеремещениеЖивотныхЖивотныеМеждуКорпусами.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеЖивотныхЖивотныеМеждуФермами.Животное,
	|	ПеремещениеЖивотныхЖивотныеМеждуФермами.Ссылка
	|ИЗ
	|	Документ.ПеремещениеЖивотных.ЖивотныеМеждуФермами КАК ПеремещениеЖивотныхЖивотныеМеждуФермами
	|ГДЕ
	|	ПеремещениеЖивотныхЖивотныеМеждуФермами.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеЖивотныхЖивотныеЗапуск.Животное,
	|	ПеремещениеЖивотныхЖивотныеЗапуск.Ссылка
	|ИЗ
	|	Документ.ПеремещениеЖивотных.ЖивотныеЗапуск КАК ПеремещениеЖивотныхЖивотныеЗапуск
	|ГДЕ
	|	ПеремещениеЖивотныхЖивотныеЗапуск.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Животные.Животное КАК Животное,
	|	МАКСИМУМ(Осеменения.Период) КАК ДатаОсеменения,
	|	вт_Животные.Документ КАК Документ
	|ПОМЕСТИТЬ вт_ЖивотныеСДатами
	|ИЗ
	|	вт_Животные КАК вт_Животные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Осеменения КАК Осеменения
	|		ПО вт_Животные.Животное = Осеменения.Животное
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Животные.Животное,
	|	вт_Животные.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЖивотныеСДатами.Животное КАК Животное,
	|	вт_ЖивотныеСДатами.ДатаОсеменения КАК ДатаПоследнегоОсеменения,
	|	Осеменения.Семя КАК БыкПоследнегоОсеменения,
	|	вт_ЖивотныеСДатами.Животное.Код КАК НомерЖивотного,
	|	вт_ЖивотныеСДатами.Животное.БиркаХорриот КАК БиркаХорриот,
	|	вт_ЖивотныеСДатами.Животное.Родословная.Отец КАК Отец,
	|	вт_ЖивотныеСДатами.Животное.Родословная.Мать КАК Мать,
	|	ИнформацияОРождении.Период КАК ДатаРождения,
	|	СостояниеЖивотныхСрезПоследних.СостояниеЖивотного КАК Статус,
	|	ДатаПредполагаемогоОтёлаСрезПоследних.ДатаПредполагаемогоОтёла КАК ДатаПредполагаемогоОтёла,
	|	вт_ЖивотныеСДатами.Документ КАК Документ,
	|	вт_ЖивотныеСДатами.Документ.Номер КАК НомерДокумента,
	|	вт_ЖивотныеСДатами.Документ.Дата КАК ДатаДокумента
	|ИЗ
	|	вт_ЖивотныеСДатами КАК вт_ЖивотныеСДатами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Осеменения КАК Осеменения
	|		ПО вт_ЖивотныеСДатами.Животное = Осеменения.Животное
	|			И вт_ЖивотныеСДатами.ДатаОсеменения = Осеменения.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЖивотных.СрезПоследних КАК СостояниеЖивотныхСрезПоследних
	|		ПО вт_ЖивотныеСДатами.Животное = СостояниеЖивотныхСрезПоследних.Животное
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатаПредполагаемогоОтёла.СрезПоследних КАК ДатаПредполагаемогоОтёлаСрезПоследних
	|		ПО вт_ЖивотныеСДатами.Животное = ДатаПредполагаемогоОтёлаСрезПоследних.Животное
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияОРождении КАК ИнформацияОРождении
	|		ПО вт_ЖивотныеСДатами.Животное = ИнформацияОРождении.Животное
	|ИТОГИ
	|	МАКСИМУМ(НомерДокумента),
	|	МАКСИМУМ(ДатаДокумента)
	|ПО
	|	Документ";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЖивотныеЗапускШапка = Макет.ПолучитьОбласть("ЖивотныеЗапускШапка");
	ОбластьЖивотныеЗапуск = Макет.ПолучитьОбласть("ЖивотныеЗапуск");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		ТабДок.Вывести(ОбластьЖивотныеЗапускШапка);
		ВыборкаЖивотныеЗапуск = Выборка.Выбрать();
		Сч = 1;
		Пока ВыборкаЖивотныеЗапуск.Следующий() Цикл
			ОбластьЖивотныеЗапуск.Параметры.Заполнить(ВыборкаЖивотныеЗапуск); 
			ОбластьЖивотныеЗапуск.Параметры.НомерСтроки = Сч;
			Сч = Сч + 1;
			ТабДок.Вывести(ОбластьЖивотныеЗапуск, ВыборкаЖивотныеЗапуск.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
